app/Http/Controllers/AgendaCfpController.php

    public function getFormProject($idProjet)
    {
        $forms = DB::table('v_formateur_cfps')
            ->select('idFormateur', 'name AS form_name', 'firstName AS form_firstname', 'photoForm AS form_photo', 'initialNameForm AS form_initial_name','email')
            ->groupBy('idFormateur', 'name', 'firstName', 'photoForm', 'initialNameForm')
            ->where('idProjet', $idProjet)->get();
---
select `idFormateur`, `name` as `form_name`, `firstName` as `form_firstname`, `photoForm` as `form_photo`, `initialNameForm` as `form_initial_name` from `v_formateur_cfps` where `idProjet` = 18 group by `idFormateur`, `name`, `firstName`, `photoForm`, `initialNameForm`

    private function getIdFormProject($idProjet)
    {
        $forms = DB::table('v_formateur_cfps')
            ->select('idFormateur')
            ->groupBy('idFormateur', 'name', 'firstName', 'photoForm', 'initialNameForm')
            ->where('idProjet', $idProjet)
            ->pluck('idFormateur');
---
select `idFormateur` from `v_formateur_cfps` where `idProjet` = 18 group by `idFormateur`, `name`, `firstName`, `photoForm`, `initialNameForm`

    public function getApprenantProjectIntra($idProjet)
    {
        $apprs = DB::table('v_list_apprenants')
            ->select('idEmploye', 'emp_initial_name', 'emp_name', 'emp_firstname', 'emp_email', 'emp_photo', 'emp_matricule', 'emp_phone', 'etp_name')
            ->where('idProjet', $idProjet)
            ->orderBy('emp_name', 'asc')
            ->get();
---
select `idEmploye`, `emp_initial_name`, `emp_name`, `emp_firstname`, `emp_email`, `emp_photo`, `emp_matricule`, `emp_phone`, `etp_name` from `v_list_apprenants` where `idProjet` = 18 order by `emp_name` asc

    public function getApprenantProjectInter($idProjet)
    {

        $apprs = DB::table('v_list_apprenant_inter_added')
            ->select('*')
            ->where('idProjet', $idProjet)
            ->get();
---
select * from `v_list_apprenant_inter_added` where `idProjet` = 18

    public function getFieldsProject($idProjet)
    {

        $projet = DB::table('v_projet_cfps')
            ->select('idProjet', 'dateDebut', 'dateFin', 'project_title', 'etp_name', 'ville', 'project_status', 'project_type', 'module_image', 'paiement', 'project_reference', 'modalite', 'idEtp')
            ->where('idProjet', $idProjet)
            ->first();
---
select `idProjet`, `dateDebut`, `dateFin`, `project_title`, `etp_name`, `ville`, `project_status`, `project_type`, `module_image`, `paiement`, `project_reference`, `modalite`, `idEtp` from `v_projet_cfps` where `idProjet` = 18 limit 1

    public function getEtpProjectInter($idProjet, $idCfp_inter)
    {
        if ($idCfp_inter == null) {
            $etp = DB::table('v_projet_cfps')
                ->select('etp_name', 'etp_logo', 'etp_initial_name')
                ->where('idProjet', $idProjet)
                ->orderBy('etp_name', 'asc')
                ->get();
        } elseif ($idCfp_inter != null) {
            $etp = DB::table('v_list_entreprise_inter')
                ->select('etp_name', 'etp_logo', 'etp_initial_name')
                ->where('idProjet', $idProjet)
                ->where('etp_name', '!=', 'null')
                ->orderBy('etp_name', 'asc')
                ->get();
---
select `etp_name`, `etp_logo`, `etp_initial_name` from `v_list_entreprise_inter` where `idProjet` = 18 and `etp_name` != 'null' order by `etp_name` asc

    private function getPrestation($idModule)
    {
        $materiel = DB::table('prestation_modules')
            ->select('prestation_name')
            ->where('idModule', $idModule)
            ->get();
---
select `prestation_name` from `prestation_modules` where `idModule` = 7