app/Http/Controllers/ConflitsController.php

select `s1`.`idProjet`, `s1`.`dateSeance`, `s1`.`heureDebut`, `s1`.`heureFin` from `seances` as `s1` inner join `projets` on `projets`.`idProjet` = `s1`.`idProjet` where `projets`.`idCustomer` = 2 order by `s1`.`dateSeance` asc, `s1`.`heureDebut` asc
---
    public function getChevauchementHeure()
    {
        $id = Auth::user()->id;

        // Obtenir toutes les séances
        $seances = DB::table('seances as s1')
            ->join('projets', 'projets.idProjet', '=', 's1.idProjet')
            ->select('s1.idProjet', 's1.dateSeance', 's1.heureDebut', 's1.heureFin')
            ->where('projets.idCustomer', $id)
            ->orderBy('s1.dateSeance')
            ->orderBy('s1.heureDebut')
            ->get();

select * from `ignoredConflitLieu`
---
    public function getConflitsLieux()
    {
        $chevauchement = $this->getChevauchementHeure();
        $conflitsArray = [];
        $idCfp = Auth::user()->id;
        $ignoredPairs = DB::table('ignoredConflitLieu')->get();

select * from `ignoredConflitFormateur`
---
    public function getConflitsFormateurs()
    {
        $chevauchement = $this->getChevauchementHeure();
        $conflitsArray = [];
        $tableignore = DB::table('ignoredConflitFormateur')->get();