app/Http/Controllers/FormDashboardController.php

    public function index()
    {
        $idFormateur = Auth::user()->id;
        $headYear = now()->format('Y');
        $projects = DB::table('v_projet_form')
            ->select([
                'v_projet_form.*',
                'customers.customerName'
            ])
            ->join('customers', 'v_projet_form.idCfp', '=', 'customers.idCustomer')
            ->where('idFormateur', $idFormateur)
            ->where('headYear', $headYear)
            ->orderBy('dateDebut', 'asc')
            ->get();

        $projectsAverage = DB::table('v_projet_form')
            ->select([
                'v_projet_form.*',
                'customers.customerName'
            ])
            ->join('customers', 'v_projet_form.idCfp', '=', 'customers.idCustomer')
            ->where('idFormateur', $idFormateur)
            ->orderBy('dateDebut', 'asc')
            ->get();

        $current_year_projects = DB::table('v_union_projets')
            ->select('v_union_projets.*')
            ->whereIn('idProjet', $projects->pluck('idProjet'))
            ->whereRaw("project_status COLLATE utf8mb4_unicode_ci = 'Terminé'")
            ->get();
---
select `v_projet_form`.*, `customers`.`customerName` from `v_projet_form` inner join `customers` on `v_projet_form`.`idCfp` = `customers`.`idCustomer` where `idFormateur` = 22 and `headYear` = '2025' order by `dateDebut` asc
select `v_union_projets`.* from `v_union_projets` where `idProjet` in (165) and project_status COLLATE utf8mb4_unicode_ci = 'Terminé'

            $histogram_data[] = $d;
        }

        $trainer_evaluated_projects = DB::table('eval_chauds')
            ->select('eval_chauds.*', 'type_questions.idTypeQuestion')
            ->join('questions', 'eval_chauds.idQuestion', '=', 'questions.idQuestion')
            ->join('type_questions', 'questions.idTypeQuestion', '=', 'type_questions.idTypeQuestion')
            ->whereIn('idProjet', $projectsAverage->pluck('idProjet'))
            ->where('type_questions.idTypeQuestion', 2)
            ->get();
---
select `eval_chauds`.*, `type_questions`.`idTypeQuestion` from `eval_chauds` inner join `questions` on `eval_chauds`.`idQuestion` = `questions`.`idQuestion` inner join `type_questions` on `questions`.`idTypeQuestion` = `type_questions`.`idTypeQuestion` where `idProjet` in (165) and `type_questions`.`idTypeQuestion` = 2

        }


        $trainer_hours = DB::table('v_seances')
            ->join('v_union_projets', 'v_seances.idProjet', '=', 'v_union_projets.idProjet')
            ->select(DB::raw('FORMAT(SUM(TIME_TO_SEC(intervalle_raw)) / 3600, 2) AS sumHourSession'))
            ->whereIn('v_seances.idProjet', $projects->pluck('idProjet'))
            ->whereRaw("v_union_projets.project_status COLLATE utf8mb4_unicode_ci = 'Terminé'")
            ->first()->sumHourSession;
---
select FORMAT(SUM(TIME_TO_SEC(intervalle_raw)) / 3600, 2) AS sumHourSession from `v_seances` inner join `v_union_projets` on `v_seances`.`idProjet` = `v_union_projets`.`idProjet` where `v_seances`.`idProjet` in (165) and v_union_projets.project_status COLLATE utf8mb4_unicode_ci = 'Terminé' limit 1