app/Http/Controllers/FormateurController.php

select DATE_FORMAT(dateDebut, "%M, %Y") AS headDate from `v_projet_form` where `idFormateur` = 22 group by `headDate` order by `dateDebut` asc
select count(*) as aggregate from `v_projet_form` where `idFormateur` = 22 and `headYear` = '2025'
---
                'cfp_name' => $projet->cfp_name,
            ];
        }
        $projectDates = DB::table('v_projet_form')
            ->select(DB::raw('DATE_FORMAT(dateDebut, "%M, %Y") AS headDate'))
            ->groupBy('headDate')
            ->orderBy('dateDebut', 'asc')
            ->where('idFormateur', $userId)
            ->get();

        $projetFormCount = DB::table('v_projet_form')
            ->where('idFormateur', $userId)
            ->where('headYear', Carbon::now()->format('Y'))
            ->count();

select COUNT(documents.idDocument) as document_count from `projets` inner join `dossiers` on `projets`.`idDossier` = `dossiers`.`idDossier` left join `documents` on `dossiers`.`idDossier` = `documents`.`idDossier` where `idProjet` = 165 limit 1
---
    public function getNombreDocument($idProjet)
    {
        $nbDocument = DB::table('projets')
            ->join('dossiers', 'projets.idDossier', '=', 'dossiers.idDossier')
            ->leftJoin('documents', 'dossiers.idDossier', '=', 'documents.idDossier')
            ->select(DB::raw('COUNT(documents.idDocument) as document_count'))
            ->where('idProjet', $idProjet)
            ->first();

select AVG(avant) as avg_avant, AVG(apres) as avg_apres from `eval_apprenant` where `idProjet` = 165 limit 1
---
    private function averageEvalApprenant($idProjet)
    {
        return DB::table('eval_apprenant')
            ->select(DB::raw('AVG(avant) as avg_avant'), DB::raw('AVG(apres) as avg_apres'))
            ->where('idProjet', $idProjet)
            ->first() ?? 0;

select `idEmploye`, `emp_name`, `emp_firstname`, `emp_photo`, `etp_name` from `v_list_apprenants` where `idProjet` = 165 order by `emp_name` asc
select `idEmploye`, `emp_name`, `emp_firstname`, `emp_photo`, `etp_name` from `v_list_apprenant_inter_added` where `idProjet` = 165 order by `emp_name` asc
---
    private function getApprListProjet($idProjet)
    {
        $apprIntras = DB::table('v_list_apprenants')
            ->select('idEmploye', 'emp_name', 'emp_firstname', 'emp_photo', 'etp_name')
            ->where('idProjet', $idProjet)
            ->orderBy('emp_name', 'asc')
            ->get()
            ->toArray();

        $apprenantInters = DB::table('v_list_apprenant_inter_added')
            ->select('idEmploye', 'emp_name', 'emp_firstname', 'emp_photo', 'etp_name')
            ->where('idProjet', $idProjet)
            ->orderBy('emp_name', 'asc')
            ->get()
            ->toArray();

select count(*) as aggregate from `emargements` where `idProjet` = 165
---
    public function checkEmg($idProjet)
    {
        $query = DB::table('emargements')->where('idProjet', $idProjet);

        if ($query) {
            return $query->count();

select count(*) as aggregate from `eval_chauds` where `idProjet` = 165
---
    public function checkEval($idProjet)
    {
        $query = DB::table('eval_chauds')->where('idProjet', $idProjet);

        if ($query) {
            return $query->count();

select `idRestauration` from `project_restaurations` where `idProjet` = 165
---
    public function getRestauration($idProjet)
    {
        $restaurations = DB::table('project_restaurations')
            ->select('idRestauration')
            ->where('idProjet', $idProjet)
            ->get()
            ->pluck('idRestauration')
            ->toArray();

select `idEtp`, `etp_name`, `etp_logo`, `etp_initial_name` from `v_projet_cfps` where `idProjet` = 165 and not `idEtp` is null order by `etp_name` asc
---
    public function getEtpProjectInter($idProjet, $idCfp_inter)
    {
        if ($idCfp_inter == null) {
            $etp = DB::table('v_projet_cfps')
                ->select('idEtp', 'etp_name', 'etp_logo', 'etp_initial_name')
                ->where('idProjet', $idProjet)
                ->whereNot('idEtp', $this->idCustomer())
                ->orderBy('etp_name', 'asc')
                ->get();

select `idSeance`, `dateSeance`, `heureDebut`, `id_google_seance`, `heureFin`, `idSalle`, `idProjet`, `salle_name`, `salle_quartier`, `project_title`, `project_description`, `idModule`, `module_name`, `ville` from `v_seances` where `idProjet` = 165
---
    public function getSessionProject($idProjet)
    {
        $countSession = DB::table('v_seances')
            ->select('idSeance', 'dateSeance', 'heureDebut', 'id_google_seance', 'heureFin', 'idSalle', 'idProjet', 'salle_name', 'salle_quartier', 'project_title', 'project_description', 'idModule', 'module_name', 'ville')
            ->where('idProjet', $idProjet)
            ->get();

select `idFormateur`, `name` as `form_name`, `firstName` as `form_firstname`, `photoForm` as `form_photo`, `initialNameForm` as `form_initial_name` from `v_formateur_cfps` where `idProjet` = 165 group by `idFormateur`, `name`, `firstName`, `photoForm`, `initialNameForm`
---
    public function getFormProject($idProjet)
    {
        $forms = DB::table('v_formateur_cfps')
            ->select('idFormateur', 'name AS form_name', 'firstName AS form_firstname', 'photoForm AS form_photo', 'initialNameForm AS form_initial_name')
            ->groupBy('idFormateur', 'name', 'firstName', 'photoForm', 'initialNameForm')
            ->where('idProjet', $idProjet)->get();

select `idEmploye`, `emp_initial_name`, `emp_name`, `emp_firstname`, `emp_email`, `emp_photo`, `emp_matricule`, `emp_phone`, `etp_name` from `v_list_apprenants` where `idProjet` = 165 order by `emp_name` asc
---
    public function getApprenantProject($idProjet)
    {
        $apprs = DB::table('v_list_apprenants')
            ->select('idEmploye', 'emp_initial_name', 'emp_name', 'emp_firstname', 'emp_email', 'emp_photo', 'emp_matricule', 'emp_phone', 'etp_name')
            ->where('idProjet', $idProjet)
            ->orderBy('emp_name', 'asc')
            ->get();

select SEC_TO_TIME(SUM(TIME_TO_SEC(intervalle_raw))) as sumHourSession from `v_seances` where `idProjet` = 165 limit 1
---
    public function getSessionHour($idProjet)
    {
        $countSessionHour = DB::table('v_seances')
            ->selectRaw('SEC_TO_TIME(SUM(TIME_TO_SEC(intervalle_raw))) as sumHourSession')
            ->where('idProjet', $idProjet)
            ->first();

select `id`, `idFormateur`, `Lieu_de_stage`, `Fonction`, `Date_debut`, `Date_fin`, `Lieu` from `experiences` where `idFormateur` = 22
select `id`, `idFormateur`, `Ecole`, `Diplome`, `Domaine`, `Date_debut`, `Date_fin` from `diplomes` where `idFormateur` = 22
select `id`, `idFormateur`, `Competence`, `note` from `competences` where `idFormateur` = 22
select `id`, `idFormateur`, `Langue`, `note` from `langues` where `idFormateur` = 22
---
    public function indexCv()
    {
        try {
            if (!Auth::check()) {
                throw new Exception('User is not authenticated.');
            }
            $userId = Auth::user()->id;

            //expériences
            $exp = DB::table('experiences')
                ->select('id', 'idFormateur', 'Lieu_de_stage', 'Fonction', 'Date_debut', 'Date_fin', 'Lieu')
                ->where('idFormateur', $userId)
                ->get();

            //diplômes
            $dp = DB::table('diplomes')
                ->select('id', 'idFormateur', 'Ecole', 'Diplome', 'Domaine', 'Date_debut', 'Date_fin')
                ->where('idFormateur', $userId)
                ->get();

            //compétences
            $cpc = DB::table('competences')
                ->select('id', 'idFormateur', 'Competence', 'note')
                ->where('idFormateur', $userId)
                ->get();

            //langues
            $lg = DB::table('langues')
                ->select('id', 'idFormateur', 'Langue', 'note')
                ->where('idFormateur', $userId)
                ->get();

select `idFormateur`, `name`, `firstName`, `cin`, `photo`, `phone`, `form_titre`, `form_speciality`, `email` from `formateurs` inner join `users` on `formateurs`.`idFormateur` = `users`.`id` inner join `role_users` on `role_users`.`user_id` = `users`.`id` where `idFormateur` = 22 limit 1
---
            return response()->json(['error' => ['message' => $e->getMessage()]], 500);
        }

        $form = DB::table('formateurs')
            ->join('users', 'formateurs.idFormateur', 'users.id')
            ->join('role_users', 'role_users.user_id', 'users.id')
            ->select('idFormateur', 'name', 'firstName', 'cin', 'photo', 'phone', 'form_titre', 'form_speciality', 'email')
            ->where('idFormateur', Auth::user()->id)
            ->first();

update `competences` set `note` = 4 where `id` = '11'
---
    public function updateNote(Request $request, $id)
    {
        $type = $request->input('type'); // Ajoutez ceci pour récupérer le type

        if ($type === 'langue') {
            DB::table('langues')
                ->where('id', $id)
                ->update(['note' => $request->note]);
        } elseif ($type === 'competence') {
            DB::table('competences')
                ->where('id', $id)
                ->update(['note' => $request->note]);

insert into `competences` (`idFormateur`, `Competence`, `note`) values (22, 'Microsoft Power Point', null)
---
                'Competence.required' => "Le competence est obligatoire"
            ]);

            DB::table('competences')->insert([
                'idFormateur' => auth()->user()->id,
                'Competence' => $req->Competence,
                'note' => $req->note
            ]);