app/Http/Controllers/LoginUserController.php

    public function login(Request $request)
    {
        if (!Auth::attempt($request->only('email', 'password'))) {
            return response()->json(['error' => 'Identifiants incorrects'], 401);
        } else {
            // Si l'utilisateur est authentifié, créer une session partagée
            session(['user_id' => Auth::user()->id]);

            $req = DB::table('role_users')
                ->select('role_id', 'user_id', 'isActive', 'user_is_deleted')
                ->join('users', 'users.id', 'role_users.user_id')
                ->where('hasRole', '=', 1)
                ->where('user_id', '=', Auth::user()->id)
                ->get();
---
select `role_id`, `user_id`, `isActive`, `user_is_deleted` from `role_users` inner join `users` on `users`.`id` = `role_users`.`user_id` where `hasRole` = 1 and `user_id` = 2