app/Http/Controllers/ProjetController.php

select SUM(project_price_pedagogique + project_price_annexe) AS project_total_price from `v_projet_cfps` where `idProjet` = 18 limit 1
---
    public function getSalleAdded($idProjet)
    {
        $idSalleProjet = DB::table('v_projet_cfps')
            ->select('idProjet', 'idSalle')
            ->where('idProjet', $idProjet)
            ->first();