app/Http/Controllers/ProspectionController.php

    public function index()
    {

        // Récupérer les opportunités
        $opportunities = DB::table('opportunites AS op')
            ->select(
                'op.id AS id_opportunite',
                'op.statut AS opportunite_id_statut',
                'op.ref_name',
                'op.ref_firstname',
                'op.ref_email AS etp_email',
                'op.ref_phone AS etp_phone',
                'op.dateDeb',
                'op.dateFin',
                'op.nbPersonne',
                'op.note AS remarque',
                'op.prix',
                'op.idEtp',
                'cst.customerName AS etp_name',
                'cst.logo AS etp_logo',
                'md.moduleName AS cours_name',
                'md.module_image AS cours_img',
                'ps.prospect_name'
            )
            ->leftJoin('customers AS cst', 'op.idEtp', '=', 'cst.idCustomer')
            ->leftjoin('mdls AS md', 'op.idModule', '=', 'md.idModule')
            ->leftJoin('prospects AS ps', 'op.id_prospect', '=', 'ps.id')
            ->where('op.idCustomer', Customer::idCustomer())
            ->where('opportunitie_is_win', 0)
            ->where('opportunitie_is_lost', 0)
            ->where('opportunitie_is_standBy', 0)
            ->orderBy('op.dateDeb', 'asc')
            ->get();
---
select `op`.`id` as `id_opportunite`, `op`.`statut` as `opportunite_id_statut`, `op`.`ref_name`, `op`.`ref_firstname`, `op`.`ref_email` as `etp_email`, `op`.`ref_phone` as `etp_phone`, `op`.`dateDeb`, `op`.`dateFin`, `op`.`nbPersonne`, `op`.`note` as `remarque`, `op`.`prix`, `op`.`idEtp`, `cst`.`customerName` as `etp_name`, `cst`.`logo` as `etp_logo`, `md`.`moduleName` as `cours_name`, `md`.`module_image` as `cours_img`, `ps`.`prospect_name` from `opportunites` as `op` left join `customers` as `cst` on `op`.`idEtp` = `cst`.`idCustomer` inner join `mdls` as `md` on `op`.`idModule` = `md`.`idModule` left join `prospects` as `ps` on `op`.`id_prospect` = `ps`.`id` where `op`.`idCustomer` = 2 and `opportunitie_is_win` = 0 and `opportunitie_is_lost` = 0 and `opportunitie_is_standBy` = 0 order by `op`.`dateDeb` asc