app/Http/Controllers/SalleCfpController.php

    public function list()
    {
        // $salles = DB::table('v_list_salles')
        //     ->select('idSalle', 'idCustomer', 'salle_name', 'salle_quartier as quartier', 'ville')
        //     ->where(function ($q) {
        //         $q->where('idLieuType', 1)
        //             ->orWhere('idCustomer', Customer::idCustomer());
        //     })
        //     ->orderBy('salle_name', 'asc')
        //     ->get();

        $idCfp = Customer::idCustomer();
        $salles = DB::table('v_liste_lieux as vll')
            ->select(
                'salles.idSalle',
                'salles.salle_name',
                'lieux.li_quartier',
                'lieux.li_rue',
                'vll.vi_code_postal as salle_code_postal',
                'vll.ville'
            )
            ->leftJoin('salles', 'salles.idLieu', 'vll.idLieu')
            ->join('lieux', 'lieux.idLieu', 'vll.idLieu')
            ->leftJoin('lieu_privates as lpv', 'lpv.idLieu', '=', 'vll.idLieu')
            ->leftJoin('place_etp_from_cfps as pefc', 'pefc.idLieu', '=', 'vll.idLieu')
            ->where(function ($query) use ($idCfp) {
                $query->where('lpv.idCustomer', $idCfp)
                    ->orWhereNull('lpv.idCustomer');
            })
            ->where(function ($query) use ($idCfp) {
                $query->where('pefc.idCfp', $idCfp)
                    ->orWhereNull('pefc.idCfp');
            })
            ->where('salles.salle_name', '!=', 'null')
            ->orderBy('salles.salle_name', 'asc')
            ->get();
---
select `salles`.`idSalle`, `salles`.`salle_name`, `lieux`.`li_quartier`, `lieux`.`li_rue`, `vll`.`vi_code_postal` as `salle_code_postal`, `vll`.`ville` from `v_liste_lieux` as `vll` left join `salles` on `salles`.`idLieu` = `vll`.`idLieu` inner join `lieux` on `lieux`.`idLieu` = `vll`.`idLieu` left join `lieu_privates` as `lpv` on `lpv`.`idLieu` = `vll`.`idLieu` left join `place_etp_from_cfps` as `pefc` on `pefc`.`idLieu` = `vll`.`idLieu` where (`lpv`.`idCustomer` = 2 or `lpv`.`idCustomer` is null) and (`pefc`.`idCfp` = 2 or `pefc`.`idCfp` is null) and `salles`.`salle_name` != 'null' order by `salles`.`salle_name` asc