app/Http/Controllers/ShowDrawerController.php

select `idEtp`, `etp_name`, `etp_logo`, `etp_initial_name` from `v_projet_cfps` where `idProjet` = '8' and not `idEtp` = 2 group by `idEtp`, `etp_name`, `etp_logo`, `etp_initial_name`
---
    public function getEtpProjectInter($idProjet, $idCfp_inter)
    {
        if ($idCfp_inter == null) {
            $etp = DB::table('v_projet_cfps')
                ->select('idEtp', 'etp_name', 'etp_logo', 'etp_initial_name')
                ->where('idProjet', $idProjet)
                ->whereNot('idEtp', Customer::idCustomer())
                ->groupBy('idEtp', 'etp_name', 'etp_logo', 'etp_initial_name')
                ->get();
        } elseif ($idCfp_inter != null) {
            $etp = DB::table('v_list_entreprise_inter')
                ->select('idEtp', 'etp_name', 'etp_logo', 'etp_initial_name')
                ->where('idProjet', $idProjet)
                ->where('etp_name', '!=', 'null')
                ->orderBy('etp_name', 'asc')
                ->groupBy('idEtp')
                ->get();

select `mdls`.* from `projets` inner join `mdls` on `projets`.`idModule` = `mdls`.`idModule` where `idProjet` = '8' limit 1
---
    public function showDocumentDrawer(Request $request)
    {
        $module = DB::table('projets')
            ->join('mdls', 'projets.idModule', 'mdls.idModule')
            ->select('mdls.*')
            ->where('idProjet', $request->idProjet)
            ->first();